const categoriesData = [
    'Фронтенд-разработчик',
    'Бэкенд-разработчик',
    'Full-stack-разработчик',
    'iOS-разработчик',
    'Android-разработчик',
    'Кросс-платформенный разработчик',
    'Графический дизайнер',
    'Веб-дизайнер',
    'Архитектор информ. систем',
    'Тестировщик ПО',
    'Аналитик данных'
] 

const citiesOptions = [
    'Астана',
    'Алматы',
    'Шымкент',
    'Актобе',
    'Актау',
    'Атырау',
    'Аркалык',
    'Алакол',
    'Аршалы',
    'Арыс',
    'Атбасар',
    'Караганда'
]

const employmentOptions = [
    'Полный график',
    'Гибкий график',
    'Ищу работу'
]
export {
    categoriesData,
    citiesOptions,
    employmentOptions
}